def working?
  ENV['USER'] != 'james'
end

brew '7zip'
# brew 'ansible'
brew 'asdf'
# brew 'atool'
# brew 'awscli' if working?
# brew 'bash'
brew 'bat'
# brew 'chruby', args: ['HEAD']
brew 'cmake'
# brew 'cmatrix'
brew 'coreutils'
brew 'ctags'
brew 'dust'
# brew 'elinks'
# brew 'elixir'
# brew 'emacs', args: ['HEAD', 'with-cocoa']
# brew 'emacs', args:['with-cocoa', 'srgb']
brew 'eza'
# brew 'exiftool'
# brew 'fasd'
brew 'fd'
brew 'ffmpeg'
brew 'figlet'
brew 'findutils'
# brew 'fortune'
# brew 'frum'
brew 'fzf'
# brew 'gdb'
brew 'ghostscript'
brew 'gh'
# brew 'ghostty' # using nightlies instead as of 2025-01-12
# brew 'git'
brew 'gnu-sed'
brew 'go'
# gpg needed for asdf nodejs and git commits
brew 'gpg'
# brew 'graphicsmagick'
brew 'grip'
# brew 'highlight'
# brew 'hugo'
brew 'imagemagick'
# brew 'jmeter', args: ['with-plugins']
brew 'jq'
brew 'k9s' if working?
brew 'kubernetes-cli' if working?
# brew 'kubernetes-helm'
brew 'lame'
brew 'lazydocker'
brew 'libbluray'
# brew 'libcaca'
brew 'libxml2'
brew 'libxslt'
brew 'libyaml'
brew 'lua'
brew 'luacheck'
brew 'luarocks'
# brew 'lynx'
# brew 'maven'
brew 'mdcat'
# brew 'mediainfo'
# brew 'mksh'
# brew 'mongodb'
# brew 'mysql'
brew 'ncdu'
brew 'neovim'
brew 'neovim-remote'
# brew 'neovim', args: ['HEAD']
brew 'node'
brew 'npm'
brew 'openssl'
brew 'pandoc'
brew 'parallel'
# pillow is used by Ranger for images
# Ranger needs to be taught to not consider Ghostty to be Kitty + tmux:
#     def _late_init(self):
#       # tmux
#       if 'kitty' not in os.environ['TERM'] and 'ghostty' not in os.environ['TERM_PROGRAM']:
brew 'pillow'
# poppler for PDF previews in Yazi
brew 'poppler'
# brew 'postgresql'
brew 'postgresql@14'
brew 'procs'
brew 'pkg-config'
brew 'python'
brew 'ranger', args: ['HEAD']
brew 'rclone'
# brew 'reattach-to-user-namespace'
# brew 'redis'
# ripgrep is needed by nvim telescope
brew 'ripgrep'
brew 'rom-tools' unless working?
brew 'ruby-install'
brew 'rustup'
brew 'sdl2'
# brew 'sdl2_gfx'
brew 'sdl2_image'
brew 'sdl2_mixer'
brew 'sdl2_ttf'
# brew 'sk'
brew 'sqlite'
brew 'stripe/stripe-cli/stripe' if working?
# brew 'the_silver_searcher'
brew 'terraform' if working?
brew 'tig'
# brew 'tmux'
brew 'tokei'
brew 'ugrep'
# brew 'vault'
# brew 'vim'
# brew 'volta'
brew 'watch'
brew 'w3m'
brew 'wget'
brew 'yarn'
brew 'yazi'
brew 'yt-dlp' # modern youtube-dl
# brew 'zsh'

# brew install heroku/brew/heroku
# tap 'heroku/brew'
# brew 'heroku'

# tap 'd12frosted/emacs-plus'
# brew 'emacs-plus', args: ['HEAD', 'without-spacemacs-icon']

# tap 'tavianator/tap'
# brew 'bfs'

# tap 'burntsushi/ripgrep'
# brew 'burntsushi/ripgrep/ripgrep-bin'

# tap 'homebrew/dupes'
# brew 'gnugrep', args: ['with-default-names']

# tap 'uptech/homebrew-oss'
# brew 'uptech/oss/alt'

# tap 'homebrew/cask'
cask '1password'
cask '1password-cli' if working?
# cask 'alacritty'
cask 'appcleaner'
# cask 'avibrazil-rdm'
# cask 'calibre'
# cask 'chefdk'
# basictex for .md -> .pdf with pandoc
cask 'basictex'
cask 'datagrip' if working?
cask 'discord' unless working?
cask 'docker'
# cask 'handbrake'
# cask 'iterm2-nightly'
# cask 'iterm2'
# cask 'java'
# cask 'java8'
# cask 'karabiner-elements'
# cask 'kindle'
cask 'kitty'
# cask 'macdown'
# cask 'makemkv'
cask 'neovide-app'
cask 'postman' if working?
cask 'rar' unless working?
# cask 'sequel-pro'
cask 'slack' unless working?
# cask 'slate'
cask 'steam' unless working?
cask 'transmission' unless working?
# cask 'tuple'
# cask 'vagrant'
# cask 'virtualbox'
# cask 'vlc'
cask 'zoom' unless working?

# fonts
# tap 'caskroom/fonts'
# cask 'font-mononoki'
# cask 'font-hack'
# cask 'font-dejavusansmono-nerd-font-mono'
# cask 'font-liberationmono-nerd-font-mono'

# tap 'homebrew/cask-drivers'
# cask 'yubico-authenticator'

# brew 'mas'
# # mas 'Xee3', id: 639764244
# # mas 'Things3', id: 904280696
# # mas 'GarageBand', id: 682658836
# # mas 'AffinityPhoto', id: 824183456
# mas 'iMovie', id: 408981434
# mas 'Pages', id: 409201541
# mas 'Keynote', id: 409183694
# mas 'Numbers', id: 409203825

# brew bundle exec -- "pip3 install neovim-remote"
