# brew 'ansible'
# brew 'atool'
# brew 'awscli'
brew 'bash'
brew 'chruby', args: ['HEAD']
brew 'cmatrix'
brew 'coreutils'
brew 'ctags'
# brew 'elinks'
# brew 'elixir'
# brew 'emacs', args: ['HEAD', 'with-cocoa']
# brew 'emacs', args: ['with-cocoa']
brew 'exa'
# brew 'exiftool'
brew 'fasd'
brew 'fd'
brew 'ffmpeg', args: ['with-libbluray']
# brew 'figlet'
brew 'findutils'
# brew 'fortune'
brew 'fzf', args: ['HEAD']
brew 'ghostscript'
brew 'git'
brew 'gnu-sed'
brew 'go'
brew 'grip'
# brew 'highlight'
# brew 'imagemagick'
# brew 'jmeter', args: ['with-plugins']
brew 'jq'
# brew 'kubernetes-cli'
# brew 'kubernetes-helm'
brew 'lame'
brew 'libbluray'
brew 'libcaca'
brew 'libxml2'
brew 'libxslt'
brew 'libyaml'
# brew 'lynx'
# brew 'maven'
# brew 'mediainfo'
# brew 'mongodb'
# brew 'mysql'
brew 'ncdu'
brew 'neovim'
brew 'npm'
brew 'openssl'
# brew 'poppler'
# brew 'postgresql'
brew 'ranger'
# brew 'reattach-to-user-namespace'
brew 'ripgrep'
brew 'ruby-install'
brew 'rustup'
# brew 'sqlite'
# brew 'the_silver_searcher'
# brew 'terraform'
brew 'tig'
# brew 'tmux'
# brew 'transmission'
# brew 'unrar'
# brew 'vault'
brew 'vim', args: ['with-override-system-vi']
brew 'watch'
brew 'w3m'
brew 'wget'
brew 'zsh'

# brew install heroku/brew/heroku
tap 'heroku/brew'
brew 'heroku'

# tap 'd12frosted/emacs-plus'
# brew 'emacs-plus', args: ['HEAD', 'without-spacemacs-icon']

# tap 'tavianator/tap'
# brew 'bfs'

# tap 'burntsushi/ripgrep'
# brew 'burntsushi/ripgrep/ripgrep-bin'

# tap 'homebrew/dupes'
# brew 'gnugrep', args: ['with-default-names']

tap 'caskroom/cask'
cask 'alacritty'
cask 'appcleaner'
cask 'avibrazil-rdm'
# cask 'calibre'
# cask 'chefdk'
cask 'docker'
cask 'handbrake'
# cask 'iterm2-nightly'
# cask 'iterm2'
# cask 'java'
# cask 'java8'
# cask 'karabiner-elements'
cask 'kindle'
cask 'kitty'
cask 'macdown'
cask 'makemkv'
cask '1password'
# cask 'sequel-pro'
cask 'slack'
# cask 'slate'
# cask 'steam'
# cask 'vagrant'
# cask 'virtualbox'
cask 'vlc'

# fonts
tap 'caskroom/fonts'
cask 'font-mononoki'
cask 'font-hack'
cask 'font-dejavusansmono-nerd-font-mono'
cask 'font-liberationmono-nerd-font-mono'

# tap 'homebrew/cask-drivers'
# cask 'yubico-authenticator'

brew 'mas'
mas 'Xee3', id: 639764244
mas 'Things3', id: 904280696
mas 'GarageBand', id: 682658836
mas 'iMovie', id: 408981434
mas 'Pages', id: 409201541
mas 'Keynote', id: 409183694
mas 'Numbers', id: 409203825
# mas 'AffinityPhoto', id: 824183456

# brew bundle exec -- "pip3 install neovim-remote"
