{
  "AetherAmethyst.nvim": { "branch": "main" },
  "Aquavium.nvim": { "branch": "main" },
  "arcana": { "branch": "main" },
  "atomic.nvim": { "branch": "main" },
  "austere.vim": { "branch": "master" },
  "backpack.nvim": { "branch": "main" },
  "bamboo.nvim": { "branch": "master" },
  "bearded-arc.nvim": { "branch": "main" },
  "bebop.nvim": { "branch": "main" },
  "brutus": { "branch": "main" },
  "catppuccin": { "branch": "main" },
  "cursor-dark.nvim": { "branch": "main" },
  "cynosure.nvim": { "branch": "master" },
  "darcula-dark.nvim": { "branch": "main" },
  "diffview.nvim": { "branch": "main" },
  "doric-themes.nvim": { "branch": "main" },
  "e-ink.nvim": { "branch": "main" },
  "eddy.nvim": { "branch": "main" },
  "edge": { "branch": "master" },
  "eggfriedrice.nvim": { "branch": "master" },
  "everforest": { "branch": "master" },
  "fieldlights.nvim": { "branch": "main" },
  "flash.nvim": { "branch": "main" },
  "ghostty-default-style-dark.nvim": { "branch": "master" },
  "gitsigns.nvim": { "branch": "main" },
  "godot_color_theme": { "branch": "master" },
  "gondolin.nvim": { "branch": "main" },
  "gruvbox-material": { "branch": "master" },
  "hearthlight.nvim": { "branch": "main" },
  "hubbamax.nvim": { "branch": "main" },
  "juliana.nvim": { "branch": "master" },
  "kaimandres.nvim": { "branch": "main" },
  "kanagawa.nvim": { "branch": "master" },
  "kiwi.nvim": { "branch": "master" },
  "koda.nvim": { "branch": "main" },
  "kukishinobu.vim": { "branch": "main" },
  "lazy.nvim": { "branch": "main" },
  "lualine.nvim": { "branch": "master" },
  "lumon.nvim": { "branch": "master" },
  "lytmode.nvim": { "branch": "main" },
  "melange-nvim": { "branch": "master" },
  "mellow.nvim": { "branch": "main" },
  "mini.icons": { "branch": "main" },
  "moegi-neovim": { "branch": "main" },
  "molokai-nvim": { "branch": "main" },
  "myrrh.nvim": { "branch": "main" },
  "nanode.nvim": { "branch": "main" },
  "nebula-drift-omega": { "branch": "main" },
  "nekomi.nvim": { "branch": "main" },
  "neovim": { "branch": "main" },
  "nightfox.nvim": { "branch": "main" },
  "noctis-nvim": { "branch": "main" },
  "nvim": { "branch": "master" },
  "nvim-earthsong": { "branch": "main" },
  "nvim-fourcolor-theme": { "branch": "main" },
  "nvim-lint": { "branch": "master" },
  "nvim-surround": { "branch": "main" },
  "nvim-treesitter": { "branch": "master" },
  "nvim-treesitter-endwise": { "branch": "master" },
  "oc-2.nvim": { "branch": "main" },
  "oil.nvim": { "branch": "master" },
  "olive-crt.nvim": { "branch": "main" },
  "one-dark-pro-max": { "branch": "main" },
  "onedark.nvim": { "branch": "master" },
  "onenord.nvim": { "branch": "main" },
  "paragon": { "branch": "master" },
  "pastel.nvim": { "branch": "master" },
  "serene.nvim": { "branch": "master" },
  "shale.nvim": { "branch": "main" },
  "shizukana.nvim": { "branch": "main" },
  "snacks.nvim": { "branch": "main" },
  "sonokai": { "branch": "master" },
  "stilla.nvim": { "branch": "main" },
  "stone.nvim": { "branch": "main" },
  "tailwind-theme.nvim": { "branch": "main" },
  "tomorrow-night-bright-rstudio.nvim": { "branch": "main" },
  "vague.vim": { "branch": "main" },
  "venice.vim": { "branch": "main" },
  "vim-monochrome": { "branch": "main" },
  "vim-nightfly-colors": { "branch": "master" },
  "vim-test": { "branch": "master" },
  "void.nvim": { "branch": "master" },
  "ymir.nvim": { "branch": "main" },
  "zazen": { "branch": "master" },
  "zenburned": { "branch": "main" },
  "zzz.vim": { "branch": "main" }
}
