{
  "AetherAmethyst.nvim": { "branch": "main" },
  "austere.vim": { "branch": "master" },
  "backpack.nvim": { "branch": "main" },
  "bamboo.nvim": { "branch": "master" },
  "catppuccin": { "branch": "main" },
  "chiefdog.nvim": { "branch": "main" },
  "darcula-dark.nvim": { "branch": "main" },
  "diffview.nvim": { "branch": "main" },
  "e-ink.nvim": { "branch": "main" },
  "edge": { "branch": "master" },
  "eggfriedrice.nvim": { "branch": "master" },
  "everforest": { "branch": "master" },
  "flash.nvim": { "branch": "main" },
  "ghostty-default-style-dark.nvim": { "branch": "master" },
  "gitsigns.nvim": { "branch": "main" },
  "gruvbox-material": { "branch": "master" },
  "hubbamax.nvim": { "branch": "main" },
  "juliana.nvim": { "branch": "master" },
  "kaimandres.nvim": { "branch": "main" },
  "kanagawa.nvim": { "branch": "master" },
  "kiwi.nvim": { "branch": "master" },
  "lazy.nvim": { "branch": "main" },
  "lualine.nvim": { "branch": "master" },
  "lytmode.nvim": { "branch": "main" },
  "melange-nvim": { "branch": "master" },
  "mellow.nvim": { "branch": "main" },
  "mini.icons": { "branch": "main" },
  "moegi-neovim": { "branch": "main" },
  "myrrh.nvim": { "branch": "main" },
  "nanode.nvim": { "branch": "main" },
  "neovim": { "branch": "main" },
  "nightfox.nvim": { "branch": "main" },
  "nvim": { "branch": "master" },
  "nvim-earthsong": { "branch": "main" },
  "nvim-fourcolor-theme": { "branch": "main" },
  "nvim-lint": { "branch": "master" },
  "nvim-surround": { "branch": "main" },
  "nvim-treesitter": { "branch": "master" },
  "nvim-treesitter-endwise": { "branch": "master" },
  "oil.nvim": { "branch": "master" },
  "onedark.nvim": { "branch": "master" },
  "onenord.nvim": { "branch": "main" },
  "serene.nvim": { "branch": "master" },
  "shizukana.nvim": { "branch": "main" },
  "snacks.nvim": { "branch": "main" },
  "sonokai": { "branch": "master" },
  "stilla.nvim": { "branch": "main" },
  "stone.nvim": { "branch": "main" },
  "vim-dadbod": { "branch": "master" },
  "vim-dadbod-completion": { "branch": "master" },
  "vim-dadbod-ui": { "branch": "master" },
  "vim-monochrome": { "branch": "main" },
  "vim-nightfly-colors": { "branch": "master" },
  "vim-test": { "branch": "master" },
  "void.nvim": { "branch": "master" },
  "ymir.nvim": { "branch": "main" },
  "zazen": { "branch": "master" },
  "zzz.vim": { "branch": "main" }
}
